//######################################################################
//###########################           SSTech       ###################
//###########################   Programming Courses  ###################
//######################################################################
let num, num1, result: number;
num = parseInt(prompt('المرجو كتابة العدد الاول '));
num1 = parseInt(prompt('المرجو كتابه العدد الثاني '));
result = num * num1;
if (result == 0) {
  console.log('ضرب العددين منعدم ');
}
